{
    "name": "hybrid-php",
    "welcome": "hybrid-php online. all systems green.",
    "doc_root" : "app/",
    "config":
    {
        "source" : {
            "css" : "src/stylus/",
            "js" : "src/app/",
            "images" : "src/images/",
            "templates" : "src/templates/",
            "fonts" : "src/fonts/"
        },
        "deploy" : {
            "css" : "css/",
            "js" : "js/",
            "images" : "images/"
        },
        "cdn" : {
            "dev": {
                "cdn_root": "/"
            },
            "prod": {
                "cdn_root": "/"
            }
        },
        "templates" : {
            "folder" : "templates/"
        },
        "paths": [
            {
                "id" : "index" ,
                "path": "/",
                "view": "pages/index.twig",
                "name" : "Intro",
                "data" : "http://local.hybrid-php.com/data/introduction.json"
            },
            {
                "id" : "documentation",
                "path": "/work",
                "paths" : [
                    {
                        "id" : "work" ,
                        "path": "/1",
                        "view": "pages/work/photos.twig",
                        "data" : "http://local.hybrid-php.com/data/photos.json",
                        "name" : "Photos 1"
                    },
                    {
                        "id" : "work" ,
                        "path": "/2",
                        "view": "pages/work/photos.twig",
                        "data" : "http://local.hybrid-php.com/data/photos.json",
                        "name" : "Photos 2"
                    },
                    {
                        "id" : "work" ,
                        "path": "/3",
                        "view": "pages/work/photos.twig",
                        "data" : "http://local.hybrid-php.com/data/photos.json",
                        "name" : "Photos 3"
                    }
                ],
                "name" : "Documentation",
                "sectionClass" : "SectionView"
            },
            {
                "id" : "blog",
                "name" : "Blog",
                "path": "/blog",
                "view": "pages/blog.twig",
                "data" : {
                    "blog" : [
                        {
                            "id": 1,
                            "body": "Cras vitae interdum turpis, aliquet tempor eros. Vivamus vitae convallis sapien. Vestibulum posuere quis tellus quis aliquet. Vivamus nisi tortor, hendrerit sed moit amet, consectetur adipiscing elit. Pellentesque habitant morbi tristique tor vel, fringilla id lectus. Ut luctus nibh diam, vitae blandit dui dignissim a. Nam elementum felis ut eros iaculis consequat."
                        },
                        {
                            "id": 2,
                            "body": "Cras vitae interdum turpis, aliquet tempor eros. Vivamus vitae convallis sapien. Vestibulum posuere quis tellus quis aliquet. Vivamus nisi tortor, hendrerit sed molestie at, pellentesque eget mnetus et malesuada fames ac turpis egestas. Maecenas vulputate semper feugiat. Etiam tincidunt ultricies convallis. Etiam venenatis in purus eget aliquam. Pellentesque lacus nulla, fringilla eget auctor vel, fringilla id lectus. Ut luctus nibh diam, vitae blandit dui dignissim a. Nam elementum felis ut eros iaculis consequat."
                        },
                        {
                            "id": 3,
                            "body": "Cras vitae interdum turpis, aliquet tempor eros. Vivamus vitae convallis sapien. Vestibulum posuere quis tellus quis aliquet. Vivamus nisi tortor, hendrerit sed molestie at, pellentesque eget metus. Loremtum felis ut eros iaculis consequat."
                        },
                        {
                            "id": 4,
                            "body": "Cras vitae interdum turpis, aliquet tempor eros. Vivamus vitae convallis sapien. Vestibulum posuere qu convallis. Etiam venenatis in purus eget aliquam. Pellentesque lacus nulla, fringilla eget auctor vel, fringilla id lectus. Ut luctus nibh diam, vitae blandit dui dignissim a. Nam elementum felis ut eros iaculis consequat."
                        }
                    ]
                },
                "sectionClass" : "SectionView"
            }
        ]
    }

}